Revit 2027 API
MacroModule.GetMacroModuleIterator Method
 Returns a Macro module iterator that iterates through the collection.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroModuleIterator GetMacroModuleIterator()
Public Function GetMacroModuleIterator As MacroModuleIterator
public:
MacroModuleIterator^ GetMacroModuleIterator()
member GetMacroModuleIterator : unit -> MacroModuleIterator
Return Value
MacroModuleIterator
 A Macro module iterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace